#### `terraform plan` Success
<details><summary>Show Output</summary>

```
unction.aws_lambda_cost_log will be updated in-place
  ~ resource "aws_lambda_function" "aws_lambda_cost_log" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost-log"
        filename                       = "modules/aws-lambda-cost/lambda.zip"
        function_name                  = "aws-lambda-cost-log"
        handler                        = "main.lambda_handler"
        id                             = "aws-lambda-cost-log"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost-log/invocations"
      ~ last_modified                  = "2020-03-03T07:59:33.345+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost-log:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::589845989135:role/aws-lambda-cost"
        runtime                        = "python3.7"
      ~ source_code_hash               = "9ZjLnjzehmaucV1rk6qMTg2S6a0koKPnq+07RQvmDOY=" -> (known after apply)
        source_code_size               = 914
        tags                           = {}
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "SLACK_CHANNEL_NAME" = "aws-cost-log"
                "SLACK_POST_URL"     = "https://hooks.slack.com/services/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"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_autoscaling_group.master-us-west-2a-masters-k8s-shunkakinoki-com will be created
  + resource "aws_autoscaling_group" "master-us-west-2a-masters-k8s-shunkakinoki-com" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupPendingInstances",
          + "GroupStandbyInstances",
          + "GroupTerminatingInstances",
          + "GroupTotalInstances",
        ]
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + load_balancers            = (known after apply)
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "master-us-west-2a.masters.k8s.shunkakinoki.com"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "KubernetesCluster"
          + propagate_at_launch = true
          + value               = "k8s.shunkakinoki.com"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "master-us-west-2a.masters.k8s.shunkakinoki.com"
        }
      + tag {
          + key                 = "k8s.io/cluster-autoscaler/node-template/label/kops.k8s.io/instancegroup"
          + propagate_at_launch = true
          + value               = "master-us-west-2a"
        }
      + tag {
          + key                 = "k8s.io/role/master"
          + propagate_at_launch = true
          + value               = "1"
        }
      + tag {
          + key                 = "kops.k8s.io/instancegroup"
          + propagate_at_launch = true
          + value               = "master-us-west-2a"
        }
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_autoscaling_group.nodes-k8s-shunkakinoki-com will be created
  + resource "aws_autoscaling_group" "nodes-k8s-shunkakinoki-com" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupPendingInstances",
          + "GroupStandbyInstances",
          + "GroupTerminatingInstances",
          + "GroupTotalInstances",
        ]
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + load_balancers            = (known after apply)
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "nodes.k8s.shunkakinoki.com"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "KubernetesCluster"
          + propagate_at_launch = true
          + value               = "k8s.shunkakinoki.com"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "nodes.k8s.shunkakinoki.com"
        }
      + tag {
          + key                 = "k8s.io/cluster-autoscaler/node-template/label/kops.k8s.io/instancegroup"
          + propagate_at_launch = true
          + value               = "nodes"
        }
      + tag {
          + key                 = "k8s.io/role/node"
          + propagate_at_launch = true
          + value               = "1"
        }
      + tag {
          + key                 = "kops.k8s.io/instancegroup"
          + propagate_at_launch = true
          + value               = "nodes"
        }
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_ebs_volume.a-etcd-events-k8s-shunkakinoki-com will be created
  + resource "aws_ebs_volume" "a-etcd-events-k8s-shunkakinoki-com" {
      + arn               = (known after apply)
      + availability_zone = "us-west-2a"
      + encrypted         = false
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 20
      + snapshot_id       = (known after apply)
      + tags              = {
          + "KubernetesCluster"                          = "k8s.shunkakinoki.com"
          + "Name"                                       = "a.etcd-events.k8s.shunkakinoki.com"
          + "k8s.io/etcd/events"                         = "a/a"
          + "k8s.io/role/master"                         = "1"
          + "kubernetes.io/cluster/k8s.shunkakinoki.com" = "owned"
        }
      + type              = "gp2"
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_ebs_volume.a-etcd-main-k8s-shunkakinoki-com will be created
  + resource "aws_ebs_volume" "a-etcd-main-k8s-shunkakinoki-com" {
      + arn               = (known after apply)
      + availability_zone = "us-west-2a"
      + encrypted         = false
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 20
      + snapshot_id       = (known after apply)
      + tags              = {
          + "KubernetesCluster"                          = "k8s.shunkakinoki.com"
          + "Name"                                       = "a.etcd-main.k8s.shunkakinoki.com"
          + "k8s.io/etcd/main"                           = "a/a"
          + "k8s.io/role/master"                         = "1"
          + "kubernetes.io/cluster/k8s.shunkakinoki.com" = "owned"
        }
      + type              = "gp2"
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_iam_instance_profile.masters-k8s-shunkakinoki-com will be created
  + resource "aws_iam_instance_profile" "masters-k8s-shunkakinoki-com" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "masters.k8s.shunkakinoki.com"
      + path        = "/"
      + role        = "masters.k8s.shunkakinoki.com"
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_iam_instance_profile.nodes-k8s-shunkakinoki-com will be created
  + resource "aws_iam_instance_profile" "nodes-k8s-shunkakinoki-com" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "nodes.k8s.shunkakinoki.com"
      + path        = "/"
      + role        = "nodes.k8s.shunkakinoki.com"
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_iam_role.masters-k8s-shunkakinoki-com will be created
  + resource "aws_iam_role" "masters-k8s-shunkakinoki-com" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "masters.k8s.shunkakinoki.com"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_iam_role.nodes-k8s-shunkakinoki-com will be created
  + resource "aws_iam_role" "nodes-k8s-shunkakinoki-com" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "nodes.k8s.shunkakinoki.com"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_iam_role_policy.masters-k8s-shunkakinoki-com will be created
  + resource "aws_iam_role_policy" "masters-k8s-shunkakinoki-com" {
      + id     = (known after apply)
      + name   = "masters.k8s.shunkakinoki.com"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeRegions",
                          + "ec2:DescribeRouteTables",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeVolumes",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                          + "ec2:CreateTags",
                          + "ec2:CreateVolume",
                          + "ec2:DescribeVolumesModifications",
                          + "ec2:ModifyInstanceAttribute",
                          + "ec2:ModifyVolume",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "ec2:AttachVolume",
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:CreateRoute",
                          + "ec2:DeleteRoute",
                          + "ec2:DeleteSecurityGroup",
                          + "ec2:DeleteVolume",
                          + "ec2:DetachVolume",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + ec2:ResourceTag/KubernetesCluster = "k8s.shunkakinoki.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "autoscaling:DescribeAutoScalingGroups",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:DescribeTags",
                          + "ec2:DescribeLaunchTemplateVersions",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "autoscaling:SetDesiredCapacity",
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                          + "autoscaling:UpdateAutoScalingGroup",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + autoscaling:ResourceTag/KubernetesCluster = "k8s.shunkakinoki.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:AttachLoadBalancerToSubnets",
                          + "elasticloadbalancing:ApplySecurityGroupsToLoadBalancer",
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateLoadBalancerPolicy",
                          + "elasticloadbalancing:CreateLoadBalancerListeners",
                          + "elasticloadbalancing:ConfigureHealthCheck",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:DeleteLoadBalancerListeners",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DetachLoadBalancerFromSubnets",
                          + "elasticloadbalancing:DeregisterInstancesFromLoadBalancer",
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:RegisterInstancesWithLoadBalancer",
                          + "elasticloadbalancing:SetLoadBalancerPoliciesForBackendServer",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeVpcs",
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:CreateTargetGroup",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:DeleteTargetGroup",
                          + "elasticloadbalancing:DeregisterTargets",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeLoadBalancerPolicies",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:SetLoadBalancerPoliciesOfListener",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:GetBucketLocation",
                          + "s3:GetEncryptionConfiguration",
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::k8s.shunkakinoki.com",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:Get*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::k8s.shunkakinoki.com/k8s.shunkakinoki.com/*"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::k8s.shunkakinoki.com/k8s.shunkakinoki.com/backups/etcd/main/*"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::k8s.shunkakinoki.com/k8s.shunkakinoki.com/backups/etcd/events/*"
                    },
                  + {
                      + Action   = [
                          + "route53:ChangeResourceRecordSets",
                          + "route53:ListResourceRecordSets",
                          + "route53:GetHostedZone",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:route53:::hostedzone/Z1YVH3KJJ7OA0H",
                        ]
                    },
                  + {
                      + Action   = [
                          + "route53:GetChange",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:route53:::change/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "route53:ListHostedZones",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:DescribeRepositories",
                          + "ecr:ListImages",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "masters.k8s.shunkakinoki.com"
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_iam_role_policy.nodes-k8s-shunkakinoki-com will be created
  + resource "aws_iam_role_policy" "nodes-k8s-shunkakinoki-com" {
      + id     = (known after apply)
      + name   = "nodes.k8s.shunkakinoki.com"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeRegions",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:GetBucketLocation",
                          + "s3:GetEncryptionConfiguration",
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::k8s.shunkakinoki.com",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:Get*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::k8s.shunkakinoki.com/k8s.shunkakinoki.com/addons/*",
                          + "arn:aws:s3:::k8s.shunkakinoki.com/k8s.shunkakinoki.com/cluster.spec",
                          + "arn:aws:s3:::k8s.shunkakinoki.com/k8s.shunkakinoki.com/config",
                          + "arn:aws:s3:::k8s.shunkakinoki.com/k8s.shunkakinoki.com/instancegroup/*",
                          + "arn:aws:s3:::k8s.shunkakinoki.com/k8s.shunkakinoki.com/pki/issued/*",
                          + "arn:aws:s3:::k8s.shunkakinoki.com/k8s.shunkakinoki.com/pki/private/kube-proxy/*",
                          + "arn:aws:s3:::k8s.shunkakinoki.com/k8s.shunkakinoki.com/pki/private/kubelet/*",
                          + "arn:aws:s3:::k8s.shunkakinoki.com/k8s.shunkakinoki.com/pki/ssh/*",
                          + "arn:aws:s3:::k8s.shunkakinoki.com/k8s.shunkakinoki.com/secrets/dockerconfig",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:DescribeRepositories",
                          + "ecr:ListImages",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "nodes.k8s.shunkakinoki.com"
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_internet_gateway.k8s-shunkakinoki-com will be created
  + resource "aws_internet_gateway" "k8s-shunkakinoki-com" {
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "KubernetesCluster"                          = "k8s.shunkakinoki.com"
          + "Name"                                       = "k8s.shunkakinoki.com"
          + "kubernetes.io/cluster/k8s.shunkakinoki.com" = "owned"
        }
      + vpc_id   = (known after apply)
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_key_pair.kubernetes-k8s-shunkakinoki-com-5c0d184514a70dee22cbc358a82bc1b6 will be created
  + resource "aws_key_pair" "kubernetes-k8s-shunkakinoki-com-5c0d184514a70dee22cbc358a82bc1b6" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + key_name    = "kubernetes.k8s.shunkakinoki.com-5c:0d:18:45:14:a7:0d:ee:22:cb:c3:58:a8:2b:c1:b6"
      + key_pair_id = (known after apply)
      + public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCnuiDe4c1NEWwKx+EuO2RQkU3hwtw0xqmoxtTa8nhj/Na0oA6rbWYSDVQ8HGhAB/yCKV00Q3arCGmS0EIIiN1vbXxRTXR2okSpWdei4pRuQBlMRgcehFvHO2yIgjgWQmJw7UX0YM1xf6DxqFb8W8cqe/o6lKku6ME3txbDCUGuLsN0MlSQtkBE7nGfqPr7Of1oXQuf6NyJHgoXXlmb5+rES3zyOy+eAk3h3Nx4/h1AHjZ9r+6oD2VXZp9wA7DuM3JDqQ/6KXB5H8lIH2xWhM2ByFVKNHfxo5UG6djBQK0f0rGjQ/Vp+0L3sl2fchCxlu5zM3uCwn/QtkAhy5T2fjyr shunkakinoki@Shuns-MacBook-Pro.local"
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_launch_configuration.master-us-west-2a-masters-k8s-shunkakinoki-com will be created
  + resource "aws_launch_configuration" "master-us-west-2a-masters-k8s-shunkakinoki-com" {
      + arn                         = (known after apply)
      + associate_public_ip_address = true
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = false
      + iam_instance_profile        = (known after apply)
      + id                          = (known after apply)
      + image_id                    = "ami-07484b38968c888a3"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + name_prefix                 = "master-us-west-2a.masters.k8s.shunkakinoki.com-"
      + security_groups             = (known after apply)
      + user_data                   = "8288824c170a2eb64bb329c974614af442746372"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = 30
          + volume_type           = "gp2"
        }
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_launch_configuration.nodes-k8s-shunkakinoki-com will be created
  + resource "aws_launch_configuration" "nodes-k8s-shunkakinoki-com" {
      + arn                         = (known after apply)
      + associate_public_ip_address = true
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = false
      + iam_instance_profile        = (known after apply)
      + id                          = (known after apply)
      + image_id                    = "ami-07484b38968c888a3"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + name_prefix                 = "nodes.k8s.shunkakinoki.com-"
      + security_groups             = (known after apply)
      + user_data                   = "3851e3e7b3a4be24938abd43e946408d118120e7"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = 128
          + volume_type           = "gp2"
        }
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_route.route-0-0-0-0--0 will be created
  + resource "aws_route" "route-0-0-0-0--0" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_route_table.k8s-shunkakinoki-com will be created
  + resource "aws_route_table" "k8s-shunkakinoki-com" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "KubernetesCluster"                          = "k8s.shunkakinoki.com"
          + "Name"                                       = "k8s.shunkakinoki.com"
          + "kubernetes.io/cluster/k8s.shunkakinoki.com" = "owned"
          + "kubernetes.io/kops/role"                    = "public"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_route_table_association.us-west-2a-k8s-shunkakinoki-com will be created
  + resource "aws_route_table_association" "us-west-2a-k8s-shunkakinoki-com" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_route_table_association.us-west-2b-k8s-shunkakinoki-com will be created
  + resource "aws_route_table_association" "us-west-2b-k8s-shunkakinoki-com" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_route_table_association.us-west-2c-k8s-shunkakinoki-com will be created
  + resource "aws_route_table_association" "us-west-2c-k8s-shunkakinoki-com" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_security_group.masters-k8s-shunkakinoki-com will be created
  + resource "aws_security_group" "masters-k8s-shunkakinoki-com" {
      + arn                    = (known after apply)
      + description            = "Security group for masters"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "masters.k8s.shunkakinoki.com"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "KubernetesCluster"                          = "k8s.shunkakinoki.com"
          + "Name"                                       = "masters.k8s.shunkakinoki.com"
          + "kubernetes.io/cluster/k8s.shunkakinoki.com" = "owned"
        }
      + vpc_id                 = (known after apply)
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_security_group.nodes-k8s-shunkakinoki-com will be created
  + resource "aws_security_group" "nodes-k8s-shunkakinoki-com" {
      + arn                    = (known after apply)
      + description            = "Security group for nodes"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "nodes.k8s.shunkakinoki.com"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "KubernetesCluster"                          = "k8s.shunkakinoki.com"
          + "Name"                                       = "nodes.k8s.shunkakinoki.com"
          + "kubernetes.io/cluster/k8s.shunkakinoki.com" = "owned"
        }
      + vpc_id                 = (known after apply)
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_security_group_rule.all-master-to-master will be created
  + resource "aws_security_group_rule" "all-master-to-master" {
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_security_group_rule.all-master-to-node will be created
  + resource "aws_security_group_rule" "all-master-to-node" {
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_security_group_rule.all-node-to-node will be created
  + resource "aws_security_group_rule" "all-node-to-node" {
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_security_group_rule.https-external-to-master-0-0-0-0--0 will be created
  + resource "aws_security_group_rule" "https-external-to-master-0-0-0-0--0" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_security_group_rule.master-egress will be created
  + resource "aws_security_group_rule" "master-egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_security_group_rule.node-egress will be created
  + resource "aws_security_group_rule" "node-egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_security_group_rule.node-to-master-tcp-1-2379 will be created
  + resource "aws_security_group_rule" "node-to-master-tcp-1-2379" {
      + from_port                = 1
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 2379
      + type                     = "ingress"
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_security_group_rule.node-to-master-tcp-2382-4000 will be created
  + resource "aws_security_group_rule" "node-to-master-tcp-2382-4000" {
      + from_port                = 2382
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4000
      + type                     = "ingress"
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_security_group_rule.node-to-master-tcp-4003-65535 will be created
  + resource "aws_security_group_rule" "node-to-master-tcp-4003-65535" {
      + from_port                = 4003
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_security_group_rule.node-to-master-udp-1-65535 will be created
  + resource "aws_security_group_rule" "node-to-master-udp-1-65535" {
      + from_port                = 1
      + id                       = (known after apply)
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_security_group_rule.ssh-external-to-master-0-0-0-0--0 will be created
  + resource "aws_security_group_rule" "ssh-external-to-master-0-0-0-0--0" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_security_group_rule.ssh-external-to-node-0-0-0-0--0 will be created
  + resource "aws_security_group_rule" "ssh-external-to-node-0-0-0-0--0" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_subnet.us-west-2a-k8s-shunkakinoki-com will be created
  + resource "aws_subnet" "us-west-2a-k8s-shunkakinoki-com" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.20.32.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "KubernetesCluster"                          = "k8s.shunkakinoki.com"
          + "Name"                                       = "us-west-2a.k8s.shunkakinoki.com"
          + "SubnetType"                                 = "Public"
          + "kubernetes.io/cluster/k8s.shunkakinoki.com" = "owned"
          + "kubernetes.io/role/elb"                     = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_subnet.us-west-2b-k8s-shunkakinoki-com will be created
  + resource "aws_subnet" "us-west-2b-k8s-shunkakinoki-com" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.20.64.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "KubernetesCluster"                          = "k8s.shunkakinoki.com"
          + "Name"                                       = "us-west-2b.k8s.shunkakinoki.com"
          + "SubnetType"                                 = "Public"
          + "kubernetes.io/cluster/k8s.shunkakinoki.com" = "owned"
          + "kubernetes.io/role/elb"                     = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_subnet.us-west-2c-k8s-shunkakinoki-com will be created
  + resource "aws_subnet" "us-west-2c-k8s-shunkakinoki-com" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.20.96.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "KubernetesCluster"                          = "k8s.shunkakinoki.com"
          + "Name"                                       = "us-west-2c.k8s.shunkakinoki.com"
          + "SubnetType"                                 = "Public"
          + "kubernetes.io/cluster/k8s.shunkakinoki.com" = "owned"
          + "kubernetes.io/role/elb"                     = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_vpc.k8s-shunkakinoki-com will be created
  + resource "aws_vpc" "k8s-shunkakinoki-com" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "172.20.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "KubernetesCluster"                          = "k8s.shunkakinoki.com"
          + "Name"                                       = "k8s.shunkakinoki.com"
          + "kubernetes.io/cluster/k8s.shunkakinoki.com" = "owned"
        }
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_vpc_dhcp_options.k8s-shunkakinoki-com will be created
  + resource "aws_vpc_dhcp_options" "k8s-shunkakinoki-com" {
      + domain_name         = "us-west-2.compute.internal"
      + domain_name_servers = [
          + "AmazonProvidedDNS",
        ]
      + id                  = (known after apply)
      + owner_id            = (known after apply)
      + tags                = {
          + "KubernetesCluster"                          = "k8s.shunkakinoki.com"
          + "Name"                                       = "k8s.shunkakinoki.com"
          + "kubernetes.io/cluster/k8s.shunkakinoki.com" = "owned"
        }
    }

  # module.aws-k8s.module.k8s_shunkakinoki_com.aws_vpc_dhcp_options_association.k8s-shunkakinoki-com will be created
  + resource "aws_vpc_dhcp_options_association" "k8s-shunkakinoki-com" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

Plan: 39 to add, 3 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
